export const RESULT_DESC_INFO = {
  DOG_LABRADOR: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '레브라도 리트리버',
    descText:
      // '원리원칙을 중요시 여기고, 한번 일을 맡으면 모든 책임을 다해 신중하게 처리하는 당신은 레브라도 리트리버가 좋은 짝꿍이 될 수 있을 거에요. <br /><br />자신의 경험을 중요시하고, 전통적인 가치관을 가지고 있기 때문에 당신은 주변인들 사이에서 꼰대가 될 수도 있어요. 그런 당신에게 예의바르고 유순하며 공격성이 적은 레브라도 리트리버는 좋은 선생님이자 친구가 되어줄 수 있을 거에요.',
      '원리원칙을 중요시 여기고, 한번 일을 맡으면 모든 책임을 다해 신중하게 처리하는 당신은 레브라도 리트리버가 좋은 짝꿍이 될 수 있을 거에요. <br /><br />자신의 경험을 중요시하고, 전통적인 가치관을 가지고 있기 때문에 당신은 주변인들 사이에서 꼰대가 될 수도 있어요. 그런 당신에게 예의바르고 유순하며 공격성이 적은 레브라도 리트리버는 좋은 선생님이자 친구가 되어줄 수 있을 거에요.원리원칙을 중요시 여기고, 한번 일을 맡으면 모든 책임을 다해 신중하게 처리하는 당신은 레브라도 리트리버가 좋은 짝꿍이 될 수 있을 거에요. <br /><br />자신의 경험을 중요시하고, 전통적인 가치관을 가지고 있기 때문에 당신은 주변인들 사이에서 꼰대가 될 수도 있어요. 그런 당신에게 예의바르고 유순하며 공격성이 적은 레브라도 리트리버는 좋은 선생님이자 친구가 되어줄 수 있을 거에요.원리원칙을 중요시 여기고, 한번 일을 맡으면 모든 책임을 다해 신중하게 처리하는 당신은 레브라도 리트리버가 좋은 짝꿍이 될 수 있을 거에요. <br /><br />',
    imagePath: '/img/dogs/dog_labrador.png',
    kindCd: '000069',
  },
  DOG_FRENCH: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '프렌치 불독',
    descText:
      '당신은 다른 사람의 감정을 잘 캐치하며 공감도 잘 해주기 때문에 주변 사람들 사이에서 착하고 친절하다는 이야기를 많이 들어요. 감정을 공감하는 능력이 뛰어나지만, 가끔 표현하는 데는 서툰 당신의 모습은 프렌치 불독과 많이 닮아 있어요.<br /><br />험상궂게 보일 수도 있지만, 항상 활달하고 명량한 성격의 프렌치 불독은 당신에게 많은 교훈을 줄 수 있을 거에요.<br /><br />언제나 사람들에게 사랑 받기를 원하는 프렌치 불독에게 인내심이 강하고 차분하며 헌신적이기도 한 당신은 최고의 주인이 되어줄 수 있을 거에요.',
    imagePath: '/img/dogs/dog_french.png',
    kindCd: '000050',
  },
  DOG_BICHON: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '비숑 프리제',
    descText:
      '당신은 냉철한 판단을 매우 잘 하고, 위선이나 가식을 떨지 않는 성격이에요. 좋게 말하면 합리적이고, 객관적이라고 말할 수도 있지만, 반대로 개인주의적 성향이 강하다고 볼 수도 있어요. 그런 당신에게 귀여운 미소를 가진 비숑 프리제가 좋은 친구가 될 수 있을 거에요.<br /><br />언제나 에너지가 넘치고 명량한 비숑 프리제를 곁에 둔다면, 생각은 넘쳐나지만 행동은 소극적인 당신의 삶에 새로운 장이 열릴 수 있다고 장담해요.<br /><br />혼자만의 시간도 좋지만, 어느새 당신 곁에서 미소를 짓고 있는 비숑 프리제를 바라보면, 당신의 입가에도 미소가 퍼져나갈 거에요.',
    imagePath: '/img/dogs/dog_bichon.png',
    kindCd: '000018',
  },
  DOG_POODLE: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '푸들',
    descText:
      '너당신은 의견 충돌을 피하고 사람 간의 화합을 중요하게 생각하며 의견 충돌을 회피하는 성향으로,  잘 단련된 인내심을 가지고 있는 성격이에요. 그런 당신에게는 주인과의 상호작용을 좋아하는 푸들이 좋은 짝꿍이 될 수 있을 거에요.<br /><br />흔히 천사견으로 불리는 푸들은 기본적으로 사람을 좋아하고, 친화력이 뛰어난 견종이에요. 또 주인의 감정을 파악하는 능력이 뛰어나 당신이 힘들 때 언제나 곁에서 위로해주는 친구가 되어줄 수 있을 거에요.<br /><br />반대로 푸들은 사람에게 애착이 많은 만큼, 외로움을 많이 타기도 해요. 다정하며 온화한 당신은 푸들에게 좋은 주인인 되어줄 수 있을 거에요.',
    imagePath: '/img/dogs/dog_poodle.png',
    kindCd: '000074',
  },
  DOG_GOLDEN: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '골든 리트리버',
    descText:
      '너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요. <br /><br /> 너무나도 귀여운 강아지라구요.  너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.<br /> 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.',
    imagePath: '/img/dogs/dog_golden.png',
    kindCd: '000054',
  },
  DOG_WHITE: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '화이트 테리어',
    descText:
      '너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요. <br /><br /> 너무나도 귀여운 강아지라구요.  너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.<br /> 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.',
    imagePath: '/img/dogs/dog_white.png',
    kindCd: '000134',
  },
  DOG_POMERANIAN: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '포메라니안',
    descText:
      '너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요. <br /><br /> 너무나도 귀여운 강아지라구요.  너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.<br /> 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.',
    imagePath: '/img/dogs/dog_pomeranian.png',
    kindCd: '000089',
  },
  DOG_SPITZ: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '재패니즈 스피츠',
    descText:
      '너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요. <br /><br /> 너무나도 귀여운 강아지라구요.  너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.<br /> 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.',
    imagePath: '/img/dogs/dog_spitz.png',
    kindCd: '000062',
  },
  DOG_KINGCHARLES: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '킹 찰스 스파니엘',
    descText:
      '너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요. <br /><br /> 너무나도 귀여운 강아지라구요.  너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.<br /> 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.',
    imagePath: '/img/dogs/dog_kingcharles.png',
    kindCd: 'ALL',
  },
  DOG_GREYHOUND: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '그레이 하운드',
    descText:
      '너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요. <br /><br /> 너무나도 귀여운 강아지라구요.  너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.<br /> 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.',
    imagePath: '/img/dogs/dog_greyhound.png',
    kindCd: '000056',
  },
  DOG_BORDERCOLLIE: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '보더콜리',
    descText:
      '너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요. <br /><br /> 너무나도 귀여운 강아지라구요.  너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.<br /> 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.',
    imagePath: '/img/dogs/dog_bordercollie.png',
    kindCd: '000020',
  },
  DOG_BEDLINGTON: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '배들링턴 테리어',
    descText:
      '너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요. <br /><br /> 너무나도 귀여운 강아지라구요.  너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.<br /> 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.',
    imagePath: '/img/dogs/dog_bedlington.png',
    kindCd: '000015',
  },
  DOG_BEAGLE: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '비글',
    descText:
      '너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요. <br /><br /> 너무나도 귀여운 강아지라구요.  너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.<br /> 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.',
    imagePath: '/img/dogs/dog_beagle.png',
    kindCd: '000013',
  },
  DOG_JINDO: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '진돗개',
    descText:
      '너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요. <br /><br /> 너무나도 귀여운 강아지라구요.  너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.<br /> 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.',
    imagePath: '/img/dogs/dog_jindo.png',
    kindCd: '000067',
  },
  DOG_MALTESE: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '말티즈',
    descText:
      '너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요. <br /><br /> 너무나도 귀여운 강아지라구요.  너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.<br /> 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.',
    imagePath: '/img/dogs/dog_maltese.png',
    kindCd: '000072',
  },
  DOG_SHIBA: {
    subTitle: '언제나 싱글벙글! <br /> 해맑게 웃는 표정!',
    title: '시바',
    descText:
      '너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요. <br /><br /> 너무나도 귀여운 강아지라구요.  너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요. 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.<br /> 너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.너무나도 귀여운 강아지라구요.',
    imagePath: '/img/dogs/dog_shiba.png',
    kindCd: '000100',
  },
};

export const TYPE_DOG_MAP = {
  ISTJ: 'DOG_LABRADOR',
  ISFJ: 'DOG_FRENCH',
  ISTP: 'DOG_BICHON',
  ISFP: 'DOG_POODLE',
  INFJ: 'DOG_GOLDEN',
  INTJ: 'DOG_WHITE',
  INFP: 'DOG_POMERANIAN',
  INTP: 'DOG_SPITZ',
  ESTP: 'DOG_KINGCHARLES',
  ESFP: 'DOG_GREYHOUND',
  ESTJ: 'DOG_BORDERCOLLIE',
  ESFJ: 'DOG_BEDLINGTON',
  ENFP: 'DOG_BEAGLE',
  ENTP: 'DOG_JINDO',
  ENFJ: 'DOG_MALTESE',
  ENTJ: 'DOG_SHIBA',
};
